In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('sample_data.xlsx')
df.head()

    Name   Age            City  Gender
0   john  25.0        New York    Male
1   Emma  30.0      Los Angels  Female
2  Peter  23.0         Chicago    Male
3  Emily  34.0  San Franscisco  Female
4    abs   NaN             xyz    Male

In [10]:
df.rename(columns = {'Fist Name':'First Name'},inplace = True)

In [11]:
df

  First Name   Age            City  Gender
0       john  25.0        New York    Male
1       Emma  30.0      Los Angels  Female
2      Peter  23.0         Chicago    Male
3      Emily  34.0  San Franscisco  Female
4        abs   NaN             xyz    Male
5      Emily  34.0  San Franscisco  Female

In [13]:
select = df[['First Name', 'Age']]
select

  First Name   Age
0       john  25.0
1       Emma  30.0
2      Peter  23.0
3      Emily  34.0
4        abs   NaN
5      Emily  34.0

In [15]:
df.dropna(inplace=True)
df.drop_duplicates(inplace = True)

In [17]:
df['occupation'] = ['Engineer','Doctor','Lawyer','Scientist']

In [18]:
df

  First Name   Age            City  Gender occupation
0       john  25.0        New York    Male   Engineer
1       Emma  30.0      Los Angels  Female     Doctor
2      Peter  23.0         Chicago    Male     Lawyer
3      Emily  34.0  San Franscisco  Female  Scientist

In [19]:
df[df.columns[-1]]

0     Engineer
1       Doctor
2       Lawyer
3    Scientist
Name: occupation, dtype: object

In [20]:
#df.iloc[row_start:row_end,col_start:col_end]

In [23]:
df.iloc[:,-1:]

  occupation
0   Engineer
1     Doctor
2     Lawyer
3  Scientist

In [24]:
df.iloc[:,-1]

0     Engineer
1       Doctor
2       Lawyer
3    Scientist
Name: occupation, dtype: object

In [ ]:
# https://thispointer.com/pandas-select-last-column-of-dataframe-in-python/